[{"name": "book-a-ticket", "examples": ["I want to book a ticket from Hyderabad to Chennai", "I'd like to book a plane ticket for a flight on August 25th", "Can you help me reserve a seat on a flight from New York to Los Angeles?", "I'm interested in flying to Paris from London on the 10th of September.", "I want to travel to Tokyo and I need a ticket for a flight next week.", "Could you assist me in booking a flight from Chicago to Miami on the 15th of October?", "I'm looking for a round-trip ticket from San Francisco to Seattle for the weekend of November 5th.", "I need to get to Dubai from Mumbai, preferably on a direct flight.", "Can you check for available flights from Toronto to Vancouver for the 20th of December?", "I'm planning a trip to Rome, and I'd like to book a business class ticket with extra legroom.", "I want to fly to London, departing on the 8th of January and returning on the 20th."]}, {"name": "check-reservation", "examples": ["What's the reservation status for booking ID ABC123?", "Can you provide me with the current boarding status for my flight?", "I'd like to know if my reservation for flight XYZ456 is confirmed.", "What's the seat number allocated for my reservation with confirmation number DEF789?", "Has there been any seat upgrade for my booking on flight LMN567?", "Can you check the reservation status for the email address john.doe@email.com?", "I want to inquire about the boarding status of my flight with booking reference GHI234.", "Please tell me the current status of my reservation for flight JKL890.", "Has there been any change in the seat assignment for my booking on flight MNO123?", "What's the reservation status for my ticket on the flight with departure code PQR456?"]}, {"name": "Private-Pilot-Lessons", "examples": ["Where can I take private pilot lessons in the US?", "Can you recommend a flight school for private pilot lessons in [City]?", "I am interested in taking private pilot lessons. Can you provide me with a list of flight schools in [State]?", "What are the requirements to become a private pilot in [Country]?", "Are there any cost-effective private pilot lessons options in [City]?", "Can you help me find a flight school that offers private pilot lessons in [State]?"]}, {"name": "Tourism-Packages", "examples": ["I'm looking for a package tour to Paris for a week in the summer.", "Can you help me plan a trip to Tokyo and book all of my accommodations and transportation?", "I want to travel to Rome for a vacation with my friends and I need help planning the itinerary.", "I'm interested in booking a trip to New York for a business conference and need to find a hotel and book a room.", "Can you assist me in planning a trip to Paris for a solo traveler?", "I want to book a trip to Amsterdam for a week in December and I'm looking for help with planning my itinerary.", "I'm planning a trip to Italy and need to find a flight from New York to Rome and book a hotel for 3 nights.", "I'm interested in booking a trip to Japan for a group of 10 people and need help with arranging all of our flights and accommodations.", "I'm looking for a package tour to London for a week in the fall and need help planning my itinerary.", "I want to book a trip to Dubai for a week in the winter and I'm looking for help with arranging all of my transportation and accommodations."]}, {"name": "Online-Tutoring", "examples": ["I need help with my algebra homework.", "I'm having trouble with the chemistry problem set, can you assist?", "Can you help me with my French grammar?", "I need some tutoring for my biology course.", "I'm struggling with the statistics concept, can you assist me?", "Can you provide me with tutoring for my computer science exam?", "I need help with my Spanish vocabulary.", "Can you assist me with my history homework?", "I'm having trouble with the English literature course, can you help me?", "Can you provide me with tutoring for my mathematics exam?"]}, {"name": "Food-and-Wine-Tours", "examples": ["Where can I take a food and wine tour in [City]?", "I'm looking for a food and wine tour in [State]. Can you recommend any options?", "I'm interested in taking a food and wine tour. Can you provide me with a list of options in [Country]?", "What are the requirements to take a food and wine tour in [State]?", "Are there any cost-effective food and wine tour options in [City]?", "Can you help me find a food and wine tour operator in [State]?"]}, {"name": "Product Warranty Information", "examples": ["How long does the warranty last for my product?", "I'm not sure about the warranty on my product. Can you help me?", "I need to return a product under warranty. Can you provide me with the necessary information?", "Can you tell me about the different types of warranties that are available for my product?", "I'm looking for the specific warranty coverage for my product. Can you help me with that?", "How can I track the progress of my product warranty?", "Can you provide me with the warranty information for my product?", "I've found a defect on my product. How do I report it and obtain warranty services?", "I'm not sure if my product is covered under warranty. Can you help me with that?"]}, {"name": "Budget-Travel-Packages", "examples": ["Can you help me find budget travel packages?", "I need to find travel deals for a budget-conscious trip.", "I'm looking for affordable travel options for my upcoming trip.", "I need to book a flight and hotel combo that fits within a budget of $500.", "Can you suggest some affordable travel packages for me to explore?", "I want to know more about budget-friendly vacation options.", "I am planning a trip and need to book flights, hotels, and other travel arrangements within a budget of $1000.", "I am looking for a travel package that includes flights, hotels, and car rentals at an affordable price.", "I need help finding a budget-friendly vacation package for my upcoming trip."]}, {"name": "Wine-Tastings", "examples": ["I'm interested in attending a wine tasting in Napa Valley.", "I'm looking for a wine tasting experience in the Tuscan region.", "Can you help me plan a wine tasting tour of France?", "I'm looking for a wine tasting event in California and need help booking a reservation.", "Can you assist me in planning a wine tasting experience in Italy?", "I want to attend a wine tasting event in the Barossa Valley of Australia and need help with accommodations and transportation.", "I'm interested in participating in a wine tasting in the Sonoma County region.", "I want to attend a wine tasting event in Washington State and need help with accommodations and transportation.", "I'm interested in a wine tasting experience in the Tuscany region of Italy."]}, {"name": "Food-Bank-Donation", "examples": ["I would like to donate food to a local food bank.", "Can you recommend a food bank in the area where I can donate some food?", "I have some fresh produce that I would like to donate to a food bank.", "I am not sure where the nearest food bank is, can you help me find one?", "I would like to donate a large amount of food to a food bank."]}, {"name": "Home-Cleaning", "examples": ["Can you clean my entire house?", "I need help with cleaning my living room.", "Please clean my kitchen for me.", "I need assistance with cleaning my bedroom.", "Can you clean my bathroom?"]}, {"name": "Hotel Room Availability", "examples": ["Where can I find hotel room availability in [City]?", "Can you check the availability of hotels in [City]?", "I am looking for a hotel room in [City] on [Date].", "Are there any discounts for hotel rooms in [City]?", "Can you help me find a hotel room in [City] for [Number] nights?", "What is the average cost of a hotel room in [City]?"]}, {"name": "Gratitude-Journals", "examples": ["Can you help me keep track of my daily gratitudes?", "I need to write down things that I am thankful for.", "Can you help me write a gratitude journal?", "I need assistance with reflecting on the positive things in my life.", "Can you help me write a gratitude journal entry?"]}, {"name": "Medical-Billing-and-Coding", "examples": ["What is the appropriate medical billing code for a patient who has suffered a broken arm?", "How do I calculate the patient's due bill for medical services?", "Can you help me understand the different medical billing codes for various types of surgeries?", "I'm unsure about the billing code for a patient who has undergone a routine blood test. Can you assist me?", "Can you provide me with an example of how medical billing and coding are used in a typical insurance claim?", "I need assistance with creating a medical billing statement for a patient who has received medical services. Can you provide me with guidelines for how to do this?", "What is the difference between medical billing and coding and the practice of medicine?"]}, {"name": "Bank Account Balance", "examples": ["What is my current bank account balance?", "Can you show me my account balance?", "I need to know my account balance urgently."]}, {"name": "Sustainable-Living", "examples": ["What are some tips for being more sustainable in our daily lives?", "How can we reduce our energy consumption at home?", "Can you suggest some sustainable alternatives to plastic bags?", "I am looking for resources to learn more about sustainable gardening. Can you provide some recommendations?", "Can you explain the concept of carbon footprint and how we can reduce it?", "How can we reduce our water consumption and optimize our water usage?", "I am interested in becoming more eco-friendly and sustainable. Can you provide some tips and advice?"]}, {"name": "Health-and-Safety-Tips", "examples": ["I want some tips on staying safe while traveling.", "Can you provide some advice on how to avoid getting sick?", "I am feeling unwell and need some tips on how to recover.", "Can you tell me about the safety measures to take during natural disasters?", "I need some advice on how to prevent and treat injuries.", "I want some information on the recommended amount of sleep to get and stay healthy."]}, {"name": "Housing-Loan-Counseling", "examples": ["How do I qualify for a housing loan?", "What are the different types of housing loans available?", "What are the eligibility criteria for housing loan?", "How much housing loan can I get?", "What are the repayment terms for a housing loan?", "What are the interest rates for a housing loan?", "Can I get a housing loan without a co-signer?", "Can I get a housing loan with a bad credit score?", "How do I make a housing loan application?"]}, {"name": "Trip-Organization", "examples": ["I need help planning a trip to Paris for a week in the summer.", "Can you assist me in booking flights and accommodations for a trip to Tokyo?", "I'm looking for assistance with arranging transportation and accommodations for a trip to Rome.", "Can you help me find a hotel and book a room for a business conference in New York?", "I want to book a trip to Paris for a solo traveler and need help planning my itinerary.", "Can you assist me in booking a trip to Amsterdam for a week in December and help me plan my itinerary?", "I want to book a trip to Italy and need help finding a flight from New York to Rome and booking a hotel for 3 nights.", "Can you help me arrange all of the flights and accommodations for a trip to Japan for a group of 10 people?", "I'm looking for help with booking a package tour to London for a week in the fall and planning my itinerary.", "Can you assist me in booking a trip to Dubai for a week in the winter and help me arrange all of my transportation and accommodations?"]}, {"name": "Transportation-Services", "examples": ["Where can I get transportation to/from [City]?", "I'm looking for a transportation service to/from [State]. Can you recommend any options?", "I'm interested in booking a transportation service to/from [Country]. Can you provide me with a list of options?", "What are the requirements to book transportation to/from [State]?", "Are there any cost-effective transportation services to/from [City]?", "Can you help me find a transportation company in [State]?"]}, {"name": "Online-Translation-Services", "examples": ["Can you translate this document for me?", "I need someone to translate this document for me.", "Can you help me translate this text?", "I am having trouble understanding this document.", "Can you translate this document into English?"]}, {"name": "Pet-Sitting-Services", "examples": ["I need a sitter for my cat who is 5 years old and loves to play fetch. She's allergic to cats and will have an EpiPen on hand in case of an emergency.", "I'm looking for a dog walker for my pooch who loves to run and sniff. He's a 3-year-old Chihuahua who is a bit high-strung.", "I want to book a pet sitting service for my dog and cat for the weekend. They're both indoor pets who love to play fetch and chase toys.", "I need someone to take care of my kitty who is new to the house. She's a sweet but shy kitten who likes to cuddle and play with toys.", "I'm looking for a pet care service for my horses who need to be taken out for a run every day. They're 10 years old and need to be exercised regularly."]}, {"name": "Mindfulness-Exercises", "examples": ["Can you guide me through a mindfulness meditation session?", "I need help with finding mindfulness exercises to do in my free time.", "I am looking for a mindfulness technique that can help me reduce stress.", "I want to learn mindfulness for workshops that I am going to present in the next few days.", "Can you provide exercises to help me focus better throughout the day?"]}, {"name": "Luxury-Car-Rentals", "examples": ["Can you provide me with the details of a luxury car rental in NYC?", "What are the options for a luxury car rental in Los Angeles?", "I am looking for a high-end car rental in Paris, do you have any recommendations?", "Can you help me find a luxury car rental with a driver for a week?", "Is there a way to rent a luxury car without a driver in Amsterdam?", "I want to rent a high-end car for my trip to Tokyo, can you help me?", "Can you provide me with the prices for a luxury car rental in Beijing?", "Do you have any discounts for luxury car rentals in Sydney?", "Can you provide me with a luxury car rental quote in New York City?", "Is there a way to book a luxury car rental with extra amenities in LA?", "Can you help me find a luxury car rental with a specific type of car?", "What are the luxury car rental options in Rome?", "I want to rent a luxury car with GPS for a week in Barcelona, can you help me?", "Can you provide me with a luxury car rental quote with a guaranteed price?", "Can you book a luxury car rental for me in Paris?", "Can you provide me with the details of a luxury car rental in Miami?", "I want to rent a high-end car for my trip to Tokyo, do you have any recommendations?", "Can you help me find a luxury car rental with a driver for a week?", "Can you provide me with the prices for a luxury car rental in Beijing?", "Do you have any discounts for luxury car rentals in Sydney?", "Can you provide me with a luxury car rental quote in New York City?", "Is there a way to book a luxury car rental with extra amenities in LA?", "Can you help me find a luxury car rental with a specific type of car?", "What are the luxury car rental options in Rome?", "I want to rent a luxury car with GPS for a week in Barcelona, can you help me?", "Can you provide me with a luxury car rental quote with a guaranteed price?"]}, {"name": "Airplane-Charter", "examples": ["I want to charter a private airplane for a business trip.", "Can you help me book a commercial flight for my family's vacation?", "I need a jet charter for my upcoming wedding.", "I'm looking for a helicopter charter for my film shoot.", "Can you assist me in booking a luxury flight for my upcoming honeymoon?", "I require a commercial flight for my work trip.", "I want to hire a private plane for a company event.", "I need to charter a corporate jet for my company.", "Can you help me find a private jet for a special event?", "I'm looking for a private jet for a personal flight.", "Can you provide me with the availability of a private jet for my upcoming vacation?"]}, {"name": "Small-Business-Loans", "examples": ["Can you provide me with some information about small business loans?", "I'm interested in finding out more about the options for small business loans. Can you tell me more about the different types of loans that are available?", "I'm starting a new business and I need some help determining the best loan option for my business. Can you help me get started?", "I'm looking to expand my business and I'm interested in learning more about the benefits of small business loans. Can you provide me with some information on the potential risks and benefits?", "I'm struggling to keep my business afloat financially. I'm looking for some assistance in refinancing my business loans. Can you help me with that?"]}, {"name": "art-tutoring", "examples": ["Do you offer any art tutoring classes?", "What are the hours for the art tutoring sessions?", "Can I take a practice test before the art tutoring session?", "What is the material required for the art tutoring session?", "What is the cost for the art tutoring session?", "Can I pay for the art tutoring session using a credit card?", "What is the refund policy for the art tutoring session?", "Can I ask for a refund after the art tutoring session?", "Is there a waiting list for the art tutoring session?", "Do you offer any additional services for art tutoring, such as consulting or project management?", "What is the average length of an art tutoring session?", "Can I take my child to the art tutoring session?"]}, {"name": "Dietary-Restrictions", "examples": ["What are some delicious vegan recipes you can recommend?", "Can you suggest some healthy meal ideas for a gluten-free diet?", "I need help finding vegetarian recipes that incorporate dairy products.", "Can you recommend some protein-rich foods that are gluten-free and vegan?", "I want to start a new diet that excludes certain ingredients. Please provide some ideas."]}, {"name": "Travel-Agent-Services", "examples": ["I'm planning a trip to [Destination] and I need some help planning my itinerary. Can you provide me with some recommendations for things to do and see there?", "I'm looking for a [type of activity] for my next vacation. Can you suggest some places in [Location] that offer [type of activity]?", "I'm interested in learning more about the culture of [Country]. Can you recommend some restaurants, museums, or other attractions that are worth visiting?", "I'm looking for a cheap travel option. Can you suggest some ways I can reduce the cost of my next trip to [Destination]?", "I'm going to [Destination] next week and I'm not sure what to pack. Can you recommend some essentials that I should include in my luggage?", "I'm considering taking a trip to [Destination] this summer. Can you provide me with some tips on how to prepare for a trip abroad?"]}, {"name": "Ski-Resort-Bookings", "examples": ["Can you help me book a ski resort for my family?", "I am looking for a good ski resort for my upcoming vacation.", "What is the best ski resort in the area?", "I need someone to book my ski vacation for me.", "Can you help me plan my ski trip?", "I am having trouble finding a good ski resort to stay at."]}, {"name": "Medical Appointment Scheduling", "examples": ["What time is my next medical appointment?", "Can you confirm my medical appointment schedule for tomorrow?", "I want to reschedule my appointment to next week", "I'm having trouble finding my appointment details", "Can you provide me with my appointment schedule for the next few weeks?"]}, {"name": "Shipping-Inquiry", "examples": ["What is the estimated delivery time for my package that was shipped to [address]?", "I'm waiting for a package that was shipped on [date] but it hasn't arrived yet. Can you help me with tracking information?", "I'm having trouble finding my delivery address for package [package ID]. Can you assist me with this?", "I've received a package that was supposed to be delivered on [date] but it was delivered [days later] instead. Can you help me with this?", "I'm having trouble locating the carrier's website for tracking [package ID]. Can you provide the URL for me?"]}, {"name": "Dietary-Supplement-Sales", "examples": ["I'm interested in purchasing a dietary supplement, what are your best sellers?", "Can you recommend a dietary supplement that is suitable for me?", "I'm looking for a dietary supplement that can help me with weight loss. Can you suggest any products that may be beneficial for me?", "I'm a fan of supplementing my diet with certain vitamins and minerals. Can you provide me with some information on what supplements you offer?", "I'm interested in purchasing a dietary supplement, but I'm not sure which one to choose. Can you help me decide?", "I'm looking for a dietary supplement that is suitable for my current health situation. Can you suggest any supplements that may be beneficial for me?", "I'm interested in purchasing a dietary supplement, but I'm not sure if it's safe. Can you provide me with some information on the potential risks and benefits of using dietary supplements?", "I'm looking for a dietary supplement that can help me with my current health situation. Can you recommend any products that may be beneficial for me?", "I'm interested in purchasing a dietary supplement, but I'm not sure if it's necessary for me. Can you provide me with some information on when it may be beneficial for me to use a dietary supplement?"]}, {"name": "Import-Export-Services", "examples": ["Can you help me book a service for international shipping and delivery?", "I'm looking for a shipping company to ship my item to Canada.", "I want to arrange a pickup for my package from my supplier.", "Can you help me with a transfer service from my office to the airport?", "I'm looking for a freight forwarder to handle the logistics of shipping my goods to Europe.", "I want to book a service to import goods from Japan.", "I'm interested in finding a cargo transportation service to transport my items to the US.", "I want to book a freight forwarding service to handle the logistics of shipping my items to Australia."]}, {"name": "Health-and-Wellness", "examples": ["What health and wellness services are available in [City]?", "I'm looking for a yoga studio in [State]. Can you recommend any options?", "I'm interested in booking a personal trainer in [Country]. Can you provide me with a list of options?", "What are the requirements to book a health and wellness service in [State]?", "Are there any cost-effective health and wellness services in [City]?", "Can you help me find a health and wellness center in [State]?"]}, {"name": "Pet-Care", "examples": ["What is the average cost of grooming a dog?", "Do you offer dog walk services?", "How long does it take for my dog to get a haircut?"]}, {"name": "Nutrition-Counseling", "examples": ["Can you assist me in developing a meal plan for a patient who has diabetes and requires a low carbohydrate diet?", "I need help understanding the benefits of vegetarian diets for patients with heart disease.", "How can I provide information on the importance of a balanced diet and its effects on health?", "I have a patient who is considering switching to a vegetarian diet, how can I prepare them for the potential challenges?", "How can I create a personalized meal plan for a patient with kidney disease?", "I have a patient with heart failure, how can I help them understand the importance of proper hydration while on a strict diet?", "I have a patient who has a history of eating disorders, how can I prepare them for a healthy and balanced diet?"]}, {"name": "Job Application Status", "examples": ["I'm having trouble with my job application status. Can you help me?", "I've applied for a job, but I'm not sure if it was successful. Can you check my application status for me?", "I've received an offer letter, but I'm not sure if it's still valid. Can you help me with that?", "I've been waiting for a response from the hiring manager for my job application, but it's taking too long. Can you help me with that?", "I'm not sure if my application was submitted successfully. Can you help me with that?", "I've received an email from the company, but I'm not sure what it means. Can you help me with that?"]}, {"name": "Natural-Remedies", "examples": ["I'm having trouble with my joint pain. Can you recommend a natural remedy for it?", "I've been having headaches for a while now. Can you suggest some natural remedies for them?", "I'm looking for a natural way to treat my acne. Can you recommend some products or techniques?", "I've been having trouble sleeping due to stress. Can you suggest some natural remedies for relaxation and better sleep?", "I'm looking for a natural remedy for anxiety. Can you recommend some products or techniques that might help?", "I've been having trouble with my allergies. Can you suggest some natural remedies for seasonal allergies?", "I'm looking for a natural remedy for skin sensitivity. Can you recommend some products or techniques that might help?", "I've been having trouble with my energy levels. Can you suggest some natural remedies for improved energy levels?", "I'm looking for a natural remedy for a specific medical condition. Can you recommend some products or techniques that might help?"]}, {"name": "Personal-Financial-Planning", "examples": ["Can you help me with financial planning for my retirement?", "I want to know how to manage my taxes and save for college.", "Can you help me create a budget for my household?", "I'm interested in learning about personal loans and financing options.", "Can you provide information on financial planning for first-time home buyers?", "I want to know how to save for a down payment on a new car.", "Can you assist me in finding a financial advisor?"]}, {"name": "Fishing-Charters", "examples": ["What are the different types of fishing charters available?", "What is the minimum age requirement to go on a fishing charter?", "What is the recommended age for fishing charters?", "What are the different fishing techniques used during a fishing charter?", "Can I choose the type of fishing charter I want to go on?", "How long do fishing charters usually last?", "Can I get a refund for a fishing charter?", "What are the cancellation policies for fishing charters?", "Do fishing charters cater to dietary restrictions?"]}, {"name": "All-Inclusive-Vacations", "examples": ["Where are the best all-inclusive resorts?", "What are the cheapest all-inclusive vacation packages?", "Can I use points or miles for my all-inclusive vacation?"]}, {"name": "Airport-Taxis", "examples": ["Can you provide a taxi service at the airport?", "Are there any taxi companies that operate at the airport?", "How much does a taxi ride from the airport to my hotel cost?", "Do you offer package deals for transportation to and from the airport?", "Can I pre-book a taxi for my upcoming trip?", "Is there a waiting list for taxi services at the airport?", "Do you offer any additional services for airport transportation, such as luggage transport or car rental?", "What is the average cost for an airport taxi ride?", "Can I take a taxi from the airport to my destination and return to the airport on the same day?"]}, {"name": "Mental-Health-Support", "examples": ["I need someone to talk to. I'm feeling really overwhelmed and I don't know how to cope.", "I'm struggling with thoughts of self-harm and suicide. Can you help me find resources for mental health support?", "I'm feeling really anxious and I'm worried about my mental health. Can you suggest some things I can do to take care of myself?", "I'm in a low point right now and I don't know where to turn for help. Can you recommend some mental health resources?", "I'm not sure if I'm struggling with depression or anxiety, but I know I need help. Can you recommend some therapists or support groups for me?"]}, {"name": "Private-Island-Resorts", "examples": ["Where is the closest private island resort?", "Can you recommend a private island resort with a private beach?", "I am looking for a luxurious private island resort with an on-site spa and restaurant."]}, {"name": "Private-Boat-Charters", "examples": ["Can you assist me in finding a private boat charter for a group of 10 for a 3-day sailing trip in the Caribbean?", "I am planning a corporate team building event and need help finding a private boat charter for a daylong outing in the waters off Miami.", "How can I book a private boat charter for a wedding and reception in the Florida Keys?", "I have a client who is looking for a unique and memorable experience for their honeymoon and need help finding a private boat charter for a day sail in the waters around Miami.", "I am planning a birthday party for a client and need help finding a private boat charter for a day cruise in the Florida Keys.", "How can I book a private boat charter for a group of 10 for a day of fishing and snorkeling in the waters off Miami?"]}, {"name": "Camping-Trips", "examples": ["I'm planning a camping trip and I need help finding a good campsite. Can you recommend some spots that are close to nature and have basic amenities?", "I'm looking for a campsite with a water source. Can you help me find one with a campground or lake nearby?", "I'm interested in going on a backpacking trip. Do you have any recommendations for campgrounds with hiking trails and scenic views?", "I'm a beginner camper and I need help with camping gear. Can you recommend some high-quality tents and sleeping bags for first-time campers?", "I'm planning a camping trip with kids. Do you have any suggestions for campgrounds with family-friendly amenities and activities?", "I'm interested in going on a camping trip in a different region of the country. Do you have any recommendations for campgrounds with unique natural features and adventure opportunities?"]}, {"name": "Mental-Health-First-Aid", "examples": ["I'm feeling really down and can't seem to shake this feeling. Can you recommend some natural remedies that might help with anxiety?", "I've been struggling with panic attacks lately. Can you suggest any natural remedies that might help with panic?", "I'm looking for a natural remedy for depression. Can you recommend some products or techniques that might help with mood?", "I've been having trouble sleeping due to stress. Can you suggest any natural remedies that might help with relaxation and better sleep?", "I'm feeling really overwhelmed with my work responsibilities. Can you recommend any natural remedies that might help with stress management?", "I'm looking for a natural remedy for insomnia. Can you recommend any products or techniques that might help with improved sleep?", "I've been struggling with PTSD. Can you recommend any natural remedies that might help with anxiety and stress management?", "I'm feeling really down and can't seem to shake this feeling. Can you recommend any natural remedies that might help with anxiety?", "I'm looking for a natural remedy for stress. Can you recommend any products or techniques that might help with reducing stress levels?"]}, {"name": "Covid-19-Support", "examples": ["I would like to know more about COVID-19 and how it affects the community.", "Can you provide information on COVID-19 vaccines and how to get them?", "I am experiencing COVID-19 symptoms and need immediate medical attention.", "Can you help me find a COVID-19 testing facility near me?", "I am concerned about the impact of COVID-19 on my family and would like to get information on resources and support available."]}, {"name": "Travel-Insurance", "examples": ["I need travel insurance for a trip to France.", "Can you provide information on travel insurance policies for international travel?", "I'm looking for insurance coverage for a trip to Hawaii.", "What types of travel insurance policies are available?", "I'm planning a trip to Japan and need help finding the best travel insurance provider.", "Can you provide me with information on travel insurance for international air travel?", "I'm considering purchasing travel insurance but want to make sure I'm getting the best coverage for my trip to Australia.", "I need insurance coverage for a trip to the United States, can you provide some recommendations?"]}, {"name": "Adventure-Parks", "examples": ["Can you recommend an adventure park near my hotel?", "What are the best adventure parks in the city?", "Are there any water parks in the area?", "Is there a park for children?", "Can I take a roller coaster or bungee jumping?", "Are there any outdoor activities like hiking or biking?", "Can I rent equipment for a day?", "What are the facilities like at the park?", "Is there a food court or restaurant?", "Are there any special deals or discounts for visitors?"]}, {"name": "Healthy-Eating-Recipes", "examples": ["Can you recommend some healthy meal ideas for vegetarians?", "I am looking for a low-carb recipe that is easy to make. Can you help?", "I am a vegan and am looking for some healthy and delicious plant-based recipes. Can you provide me with some options?", "I am trying to eat healthier and would like some suggestions for healthy breakfast options.", "I am a gluten-free and would like some recipes that are suitable for me.", "I am looking for some healthy and easy snack ideas for a healthy living diet."]}, {"name": "Emotional-Intelligence-Development", "examples": ["I'm having trouble managing my emotions and I'm looking for some advice on how to improve my emotional intelligence. Can you help me?", "I'm feeling stressed and anxious, and I'm not sure how to deal with these feelings. Can you provide some guidance on how to manage my emotions?", "I'm struggling to understand the emotions of others and I'm not sure how to navigate those interactions. Can you help me with that?", "I'm interested in learning more about the different types of emotional intelligence and how it can be developed. Can you provide me with some information on that?", "I'm looking for some resources or tools that can help me improve my emotional intelligence. Can you recommend anything?"]}, {"name": "Skydiving-Excursions", "examples": ["Can you help me plan a skydiving excursion?", "I want to book a skydiving excursion for my upcoming vacation.", "What is the best skydiving spot for this type of experience?", "I need someone to book my skydiving excursion for me.", "Can you help me get a great spot for my skydiving experience?", "I am having trouble finding a skydiving spot that suits my needs."]}, {"name": "Aromatherapy", "examples": ["Can you please prepare a aromatherapy session for me?", "I need help with relaxing and de-stressing during the day.", "Please create a soothing scent for me, I'm feeling anxious.", "I'm looking for a calming candle scent to help me unwind after a long day.", "I need some aromatherapy for a headache."]}, {"name": "Nature-Photography-Trips", "examples": ["Can you suggest some photography trips in nature?", "What is the cost for a photography trip in nature?", "Can I pay for a photography trip in nature using a credit card?", "What is the refund policy for a photography trip in nature?", "Can I ask for a refund after a photography trip in nature?", "Is there a waiting list for a photography trip in nature?", "Do you offer any additional services for photography trips in nature, such as consulting or project management?", "What is the average length of a photography trip in nature?", "Can I take my child on a photography trip in nature?"]}, {"name": "Golf-Course-Reservations", "examples": ["I would like to make a reservation for a group of 8 people for the weekend of 12/20/2023. Can you help me with that?", "I'm looking for a tee time at your course for 3:00 PM on Friday. Can you assist me with that?", "I need a reservation for a group of 5 people for the 11/22/2023. Can you help me with that?", "I'm interested in making a reservation for a group of 10 people for the 12/21/2023. Can you assist me with that?", "I'm looking for a tee time at your course for 1:00 PM on Monday. Can you assist me with that?", "I need a reservation for a group of 6 people for the 10/20/2023. Can you help me with that?", "I'm interested in making a reservation for a group of 4 people for the 11/21/2023. Can you assist me with that?", "I'm looking for a tee time at your course for 2:00 PM on Tuesday. Can you assist me with that?"]}, {"name": "Crisis-Communication", "examples": ["Can you help me with a crisis communication plan?", "I need some advice on how to handle a crisis situation.", "I am currently going through a crisis and need some support.", "Can you provide guidance on how to communicate effectively during a crisis?", "I am not sure how to handle a crisis and could use some guidance."]}, {"name": "Community-Building", "examples": ["I'm looking for ways to build a sense of community in our office. Can you help me find resources or strategies for doing so?", "I'm interested in joining a community within my organization. Can you help me find ways to get involved and meet other members?", "I'm having trouble connecting with colleagues in my department. Can you suggest ways to improve communication and foster a sense of community?", "I'm not sure how to get involved in my company's community. Can you help me find resources or opportunities to get involved?", "I've heard that building a strong community can lead to increased engagement and productivity. Can you provide more information on the benefits of community building?", "I'm interested in learning more about the community within my organization. Can you help me find resources or ways to get involved?"]}, {"name": "Hotel-Room-Cleaning", "examples": ["When will the hotel room be cleaned?", "Can I get a refund for the cleaning fee?", "What is the standard cleaning frequency for the hotel room?", "Are the sheets freshly laundered every day?", "Are the pillows and blankets freshly laundered every day?", "Is the bathroom sink cleaned every morning?", "Is the bathroom mirror cleaned every morning?", "Is the carpet vacuumed every day?", "Is the room dusted every day?", "Is the room de-bugged every week?"]}, {"name": "Yacht-Charter", "examples": ["I'm interested in chartering a yacht for a weekend getaway. Can you help me with that?", "I need to book a yacht for a wedding. Can you assist me with the reservation?", "I'm looking for a yacht rental for a corporate event. Can you provide me with some options?", "I'm interested in a yacht cruise for a family vacation. Can you suggest some popular destinations?", "I need to hire a yacht for a private event. Can you provide me with a quote?", "I'm not sure about the cost of a yacht charter. Can you help me with that?", "I want to know more about the amenities and services offered by the yacht. Can you provide me with some information?", "I'm looking for a yacht with a specific feature, such as a spa or fitness center. Can you help me with that?", "I need to book a yacht with a specific number of guests. Can you help me with that?", "I want to know more about the crew and crew services offered by the yacht. Can you provide me with some information?"]}, {"name": "Stress-Management", "examples": ["I am feeling very stressed and overwhelmed.", "Can you help me find a stress management technique that works for me?", "I need advice on how to manage my stress levels.", "I am experiencing a lot of anxiety and want to find ways to reduce it.", "I am having trouble sleeping due to stress and need help finding solutions.", "I am feeling very anxious and overwhelmed and need some guidance on how to manage my stress levels."]}, {"name": "Restaurant Reservation", "examples": ["Can you please reserve a table for me at the restaurant next week?", "I need a reservation at the restaurant on Friday.", "I would like to make a reservation for dinner at the restaurant tonight.", "I'm looking for a restaurant that serves Italian food and has a good view of the city.", "I'm trying to find a restaurant that offers vegetarian options."]}, {"name": "Self-Care-Routines", "examples": ["What are some self-care routines that I can follow?", "Can you suggest some self-care activities that I can do to manage my stress?", "I am looking for some ideas to help me relax and reduce stress."]}, {"name": "Personal-Finance-Planning", "examples": ["How much do I need to save for retirement?", "What is the best way to invest my money?", "How do I manage my credit card debt?"]}, {"name": "Personalized-Travel-Plans", "examples": ["I'm interested in traveling to [destination] next month. Can you help me plan a trip?", "Can you recommend a hotel near [attraction] for a budget-friendly vacation?", "I'm looking for a romantic getaway to [city]. Can you suggest a luxury resort?", "I want to visit [place] and I don't have a lot of time. Can you help me plan a quick trip?", "I'm a vegan and I'm looking for a travel plan that includes vegan-friendly options. Can you help me plan a trip that fits my dietary needs?", "I'm planning a trip to [destination] and I want to be able to walk everywhere. Can you suggest hotels and attractions that are easily accessible on foot?", "I'm looking for a trip that's outside of the US. Can you suggest some great destinations to visit?", "I'm a solo traveler and I want to stay connected while I'm away. Can you recommend some travel apps that are helpful for solo travelers?", "I'm planning a trip to [destination] and I want to make sure I'm prepared for any unexpected events. Can you suggest some travel insurance options?", "I'm looking for a trip that's both relaxing and adventurous. Can you suggest some great destinations that offer a mix of both?", "I'm a young traveler and I want to make sure I'm staying safe while I'm traveling. Can you recommend some tips for staying safe while traveling?", "I'm planning a trip to [destination] and I want to be able to do some outdoor activities like hiking or biking. Can you suggest some great outdoor destinations?", "I'm looking for a trip that's good for my mental health. Can you suggest some destinations that are known for their mental health amenities?", "I'm planning a trip to [destination] and I want to make sure I'm able to meet people while I'm away. Can you recommend some great travel groups or meetup websites?", "I'm looking for a trip that's good for my budget. Can you suggest some great travel deals or discounts?", "I'm planning a trip to [destination] and I want to make sure I'm able to explore everything there is to see and do. Can you suggest some great travel blogs or websites that offer advice and recommendations?", "I'm a senior traveler and I want to make sure I'm able to stay safe and comfortable while I'm traveling. Can you recommend some travel apps or websites that are geared towards seniors?", "I'm planning a trip to [destination] and I want to make sure I'm able to get around easily and independently. Can you suggest some travel apps or websites that offer accessible transportation options?", "I'm looking for a trip that's good for my physical health. Can you suggest some destinations that offer great physical activities like yoga or hiking?", "I'm planning a trip to [destination] and I want to make sure I'm able to relax and unwind while I'm away. Can you recommend some great travel spas or wellness centers?", "I'm looking for a trip that's good for my cultural awareness. Can you suggest some destinations that offer great cultural experiences?", "I'm planning a trip to [destination] and I want to make sure I'm able to stay connected with friends and family while I'm away. Can you recommend some great travel social media or messaging apps that are helpful for travelers?", "I'm looking for a trip that's good for my mental health. Can you suggest some destinations that offer mental health amenities or therapy services?", "I'm planning a trip to [destination] and I want to make sure I'm able to stay safe and secure while I'm away. Can you recommend some great travel safety and security apps or websites that are helpful for travelers?", "I'm looking for a trip that's good for my overall health. Can you suggest some destinations that offer great health and wellness amenities?", "I'm planning a trip to [destination] and I want to make sure I'm able to have a great time while I'm away. Can you recommend some great travel guides or websites that offer advice and recommendations?"]}, {"name": "Career-Coaching", "examples": ["I'm looking for a career coach to help me with my job search.", "Can you help me find a job that matches my skills and interests?", "I'm considering a change of career and would like to get advice on the best path forward.", "I need help with a career transition and would like some guidance on what to do next.", "I'm trying to stay focused and motivated in my current job, but I'm feeling burnt out.", "I'm looking for a coach to help me with my resume and cover letter.", "I need some advice on how to negotiate a raise.", "I'm looking for a career coach to help me with my interview prep.", "I need some guidance on how to navigate a career change that has been unexpected.", "I'm struggling with anxiety and depression and I'm not sure what to do next.", "I need help with a job change that I'm not sure is the right move for me.", "I'm feeling overwhelmed by my current job and I need some guidance on how to handle it.", "I need some advice on how to navigate a career change that is required by my company.", "I'm looking for a career coach to help me with my networking skills.", "I'm considering a new career path and I need some guidance on what to do next.", "I'm looking for a career coach to help me with my job search strategy."]}, {"name": "Outdoor-Recreation", "examples": ["Can you recommend some outdoor activities to do in the park?", "I am looking for a place to go hiking.", "Do you have any recommendations for outdoor sports to play?", "I am interested in trying rock climbing.", "Can you suggest some places to go camping?"]}, {"name": "Educational Course Enrollment", "examples": ["I am interested in enrolling in the course 'Introduction to Psychology'.", "I would like to register for the course 'Business and Economics' this semester.", "Can I enroll in the course 'Environmental Science' next academic year?"]}, {"name": "Ziplining-Adventures", "examples": ["Can you help me plan a ziplining adventure?", "I am interested in going on a ziplining tour.", "I want to take a ziplining adventure, can you assist me?", "I need some information about ziplining adventures in [location].", "Can you provide me with tips on how to enjoy a ziplining adventure?"]}, {"name": "Child-Care-Services", "examples": ["I need a babysitter for my kiddo tonight.", "Can you recommend a good daycare for my toddler?", "I am looking for a nanny who can take care of my children.", "I'm trying to find a childcare center that offers before and after school programs.", "I'm looking for a nanny who is experienced in handling children with special needs."]}, {"name": "Private-Jet-Reservations", "examples": ["I need to book a private jet reservation for a special occasion.", "I am looking for a private jet that can accommodate 10 people.", "Can you help me find a private jet that has good food and beverage service?", "I need to know the prices for a private jet reservation for a flight that lasts 2 hours."]}, {"name": "Weather Forecast", "examples": ["What is the weather forecast for the next week?", "Can you provide me with the weather forecast for next month?", "How's the weather going to be on Saturday?", "I need to know what the weather will be like on Thursday", "Can you tell me what the weather will be like tomorrow morning?"]}, {"name": "Gardening", "examples": ["What are the best plants for [garden]?", "I'm looking for a gardening service in [city]", "How do I grow [plant]?", "I need advice on pruning [shrub]", "Can you help me with [gardening tool]?"]}, {"name": "Mental-Health-Assessments", "examples": ["I'm feeling very anxious and overwhelmed with my work and relationships.", "I need help understanding my mental health and well-being.", "I'm struggling with depression and I don't know where to turn.", "I'm feeling hopeless and I'm not sure if I want to go on anymore.", "I'm looking for a mental health professional who can help me manage my symptoms."]}, {"name": "Home-Repair-Services", "examples": ["What kind of home repair services do you offer?", "I need someone to fix a leak in my roof.", "My basement needs to be redone. Can you provide a quote?"]}, {"name": "Car Rental Reservation", "examples": ["I want to rent a car for a trip to Paris for the next week.", "I need a car for a trip to Orlando for the weekend.", "I'm looking for a rental car for a business trip to New York City next month.", "I need a car for a weekend getaway to San Francisco.", "I'm planning a road trip to Chicago and I'm looking for a rental car for the entire trip.", "I'm looking for a rental car for a 7-day trip to Las Vegas."]}, {"name": "Organic-Gardening", "examples": ["I'm interested in starting an organic garden. Can you provide me with some advice?", "I need to purchase seeds for my garden. Can you suggest any organic options?", "I want to know more about the best soil for an organic garden. Can you provide me with some information?", "I'm looking for pest control methods that are safe for my plants. Can you suggest any options?", "I'm not sure about the best tools for organic gardening. Can you provide me with some recommendations?", "I want to know more about the benefits of organic gardening. Can you provide me with some information?", "I'm interested in using natural fertilizers for my garden. Can you provide me with some recommendations?", "I want to know more about the best gardening practices for a small space. Can you provide me with some advice?", "I'm looking for tips on how to grow specific types of plants in my garden. Can you provide me with some suggestions?", "I want to know more about the different types of composting that can be used in organic gardening. Can you provide me with some information?"]}, {"name": "Disaster-Relief", "examples": ["I am interested in donating money for disaster relief efforts.", "I am looking for ways to help with disaster relief efforts, such as providing supplies or volunteering.", "I would like to donate my time to help with disaster relief efforts, such as by distributing supplies or assisting with evacuations."]}, {"name": "Mountain-Biking-Rentals", "examples": ["I need to rent mountain bikes for a day trip in the mountains.", "Can you help me find mountain bikes that are durable and can handle heavy terrain?", "I want to rent mountain bikes for a weekend adventure with my friends. How much will it cost?"]}, {"name": "Dental-Care-Plans", "examples": ["Can you help me find a dentist who offers a dental care plan?", "I need to learn more about dental care plans and the benefits they provide.", "I recently found out I have dental insurance through my employer. Can you help me understand my plan and any coverage I may have for dental care?", "I would like to know if my dental care plan covers crowns, bridges, or extractions.", "I have a family dental care plan through my employer. Can you provide me with the most up-to-date information about my coverage?", "I need to find a dentist who offers a dental care plan that covers dental implants.", "I recently saw an ad for a dental care plan that is completely free of charge. Can you tell me more about that?", "I'm not sure what kind of dental care plan I have through my employer. Can you help me figure out what kind of coverage I have?", "I would like to get quotes from different dental care plans to find the best option for me. Can you help me with that?", "I am interested in dental care plans that offer dental X-rays and implants. Do you have any recommendations?"]}, {"name": "Cultural-Tours", "examples": ["Can you recommend some cultural tours for a group of 20 people?", "What is the cost for a cultural tour?", "Can I pay for a cultural tour using a credit card?", "What is the refund policy for a cultural tour?", "Can I ask for a refund after a cultural tour?", "Is there a waiting list for a cultural tour?", "Do you offer any additional services for cultural tours, such as consulting or project management?", "What is the average length of a cultural tour?", "Can I take my child on a cultural tour?"]}, {"name": "Helicopter-Rides", "examples": ["I'm interested in taking a helicopter ride over the city.", "I want to go on a helicopter tour of the nearby area.", "Can you take me on a helicopter ride over the ocean?", "I'm planning a vacation to a remote location and would like to go on a helicopter tour.", "I'm looking for a helicopter tour that includes a scenic flight over the mountains."]}, {"name": "Technical Support", "examples": ["I need help with the setup of my computer.", "Can you assist me with troubleshooting a technical issue?", "I am experiencing difficulties with my internet connection.", "I need advice on how to upgrade my computer's RAM."]}, {"name": "Household-Organization", "examples": ["Can you assist me in organizing my household?", "I'm overwhelmed with household tasks. Can you provide some tips for me on how to stay organized?", "I need to get my act together and clean my house. Can you give me some advice on how to get started?", "I'm planning to move and I need to get everything organized before I go. Can you help me prepare a moving checklist?", "I'm having trouble keeping track of my household finances. Can you offer some advice on how to stay on top of my expenses?"]}, {"name": "Preparedness-Guides", "examples": ["I'm looking for preparedness guides for my community. Can you provide me with some information on how to create and use these guides?", "I'm interested in learning more about emergency preparedness and how to create a personal emergency plan. Can you provide me with some guidance on that?", "I'm looking for tips and advice on how to stay informed during an emergency. Can you provide me with some suggestions on what to do and not to do?", "I'm not sure where to go if there is an emergency. Can you provide me with some guidance on how to respond and what to do?", "I'm interested in learning more about emergency preparedness and how to help others prepare for emergencies. Can you provide me with some information on that?", "I'm looking for resources or tools that can help me stay prepared for emergencies. Can you recommend anything?"]}, {"name": "Event-Planning-Services", "examples": ["I need help planning a wedding in Los Angeles.", "I'm looking for a wedding planner in New York City.", "Can you assist me in planning a birthday party for my daughter in Chicago?", "I want to hire a wedding planner in San Francisco and need help finding a venue.", "I'm interested in a wedding planner in Atlanta and need help with flowers and decor.", "I want to attend a wedding in Las Vegas and need help booking a hotel room.", "Can you help me plan a funeral in Seattle?", "I'm interested in a funeral home in Phoenix and need help with transportation and a viewing.", "I want to attend a funeral in San Diego and need help booking a hotel room."]}, {"name": "Motorcycle-Rental", "examples": ["Can you help me find a motorcycle rental company in the area?", "I'm looking for a motorcycle rental company that has a wide selection of models. Can you recommend any?", "I'm interested in renting a motorcycle for a week. Can you provide me with some options?", "I'm looking for a motorcycle rental company that offers affordable rates. Can you recommend any?", "I'm not sure which type of motorcycle I want to rent. Can you help me find one that's suitable for my needs?", "I'm looking for a motorcycle rental company that offers customization options. Can you recommend any?", "I'm looking for a motorcycle rental company that offers additional amenities, such as insurance or accessories. Can you recommend any?", "I'm interested in renting a motorcycle for a long trip. Can you provide me with some suggestions on how to choose the right motorcycle and accessories for the journey?", "I'm looking for a motorcycle rental company that offers maintenance and repair services. Can you recommend any?", "I'm not sure what type of insurance I need for a motorcycle rental. Can you help me find out?", "I'm looking for a motorcycle rental company that offers pickup and drop-off services. Can you recommend any?"]}, {"name": "Sightseeing-Tours", "examples": ["What are the tours available in the city?", "Can you show me the schedule of tours?", "I need to know more about the tours, how long will they last?"]}, {"name": "Teacher Employment", "examples": ["Can you tell me about job openings in your school for teachers?", "I need information about job opportunities for teachers in your district?", "I'm interested in knowing about the hiring process for teacher positions in your school.", "What is the timeline for applying for teacher positions?", "What are the minimum qualifications for teaching positions in your school?"]}, {"name": "Meal-Planning", "examples": ["I need help planning a meal for the weekend.", "I'm looking for a recipe for a healthy breakfast dish that's easy to prepare.", "I want to make a meal for my family on a tight budget.", "I'm looking for a simple side dish that pairs well with a specific type of protein.", "I'm a vegan and I'm looking for a recipe that fits my dietary restrictions.", "I need recommendations for a restaurant that serves plant-based food."]}, {"name": "Furniture-Assembly", "examples": ["Can you help me assemble my sofa?", "I'm having trouble assembling my bed. Can you help me?", "I've got a new dresser and I can't seem to get it together. Can you help me?", "I've got a couch that's broken. Can you help me fix it?", "I'm trying to build a new table but I'm having trouble putting it together. Can you help me?", "I've got a bookshelf that needs fixing. Can you help me?"]}, {"name": "Private Beach Club Rentals", "examples": ["I'm looking for a private beach club to rent for my next vacation. Do you have any recommendations?", "I'm interested in renting a private beach club for my family's anniversary. Can you help me find one?", "I'm planning a trip to Hawaii and I'm looking for a private beach club with a pool. Can you help me find one?", "I've been to a few private beach clubs before, but I'm looking for something that's completely different. Can you suggest some options?", "I'm interested in renting a private beach club for my company's next conference. Can you help me find one?", "I'm not sure if my rental contract includes a private beach club. Can you help me with that?", "I'm not sure if my rental agreement includes a private beach club. Can you help me with that?"]}, {"name": "Personal-Fitness-Training", "examples": ["Where can I get a personal fitness training session?", "What are the types of personal fitness training available?", "Can you provide me with a personal fitness training schedule?"]}]