[{"name": "book-a-ticket", "utterance": " \"I'd like to book a flight ticket from Hyderabad to Chennai.\""}, {"name": "check-reservation", "utterance": " \"Please provide me with the current reservation status for my flight.\""}, {"name": "Private-Pilot-Lessons", "utterance": " \"I'm interested in taking private pilot lessons. Can you recommend a flight school in City?\""}, {"name": "Tourism-Packages", "utterance": " \"I'm looking for a package tour to Paris for a week in the summer.\""}, {"name": "Online-Tutoring", "utterance": " \"I need help with my algebra homework.\""}, {"name": "Food-and-Wine-Tours", "utterance": " \"I'm interested in taking a food and wine tour. Can you provide me with a list of options in City/State/Country?\""}, {"name": "Product Warranty Information", "utterance": " \"I'm looking for information about the warranty on my product. Can you help me?\""}, {"name": "Budget-Travel-Packages", "utterance": " \"I'm looking for budget travel packages.\""}, {"name": "Wine-Tastings", "utterance": " \"I'm interested in attending a wine tasting in Napa Valley.\""}, {"name": "Food-Bank-Donation", "utterance": " \"I would like to donate food to a local food bank.\""}, {"name": "Home-Cleaning", "utterance": " \"Can you help me with cleaning my entire house?\""}, {"name": "Hotel Room Availability", "utterance": " \"I'd like to check hotel room availability in City.\""}, {"name": "Gratitude-Journals", "utterance": " \"Can you help me keep track of my daily gratitudes?\""}, {"name": "Medical-Billing-and-Coding", "utterance": " \"I'm looking for information on medical billing and coding.\""}, {"name": "Bank Account Balance", "utterance": " \"Please provide me with the current status of my reservation.\""}, {"name": "Sustainable-Living", "utterance": " \"What are some sustainable living tips?\""}, {"name": "Health-and-Safety-Tips", "utterance": " \"I want some tips on staying safe while traveling.\""}, {"name": "Housing-Loan-Counseling", "utterance": " \"I can help you with your housing loan counseling questions. What would you like to know?\""}, {"name": "Trip-Organization", "utterance": " \"I need help planning a trip to Paris for a week in the summer.\""}, {"name": "Transportation-Services", "utterance": " \"I'm looking for transportation services to/from City/State/Country. Can you recommend any options?\""}, {"name": "Online-Translation-Services", "utterance": " \"Can you translate this document for me?\""}, {"name": "Pet-Sitting-Services", "utterance": " \"I'm looking for a pet sitting service for my dog and cat.\""}, {"name": "Mindfulness-Exercises", "utterance": " \"I can guide you through a mindfulness meditation session.\""}, {"name": "Luxury-Car-Rentals", "utterance": " \"I'd like to book a luxury car rental for a week in City with a driver.\""}, {"name": "Airplane-Charter", "utterance": " \"I'm looking for a private jet for a personal flight.\""}, {"name": "Small-Business-Loans", "utterance": " \"I'm interested in learning more about small business loans.\""}, {"name": "art-tutoring", "utterance": " \"I can help you with art tutoring classes, hours, practice tests, materials, cost, payment methods, refund policies, waiting lists, additional services, session length, and child participation.\""}, {"name": "Dietary-Restrictions", "utterance": " \"I'm looking for dietary restrictions. Can you help me with some healthy meal ideas?\""}, {"name": "Travel-Agent-Services", "utterance": " \"I'm looking for travel agent services. Can you help me plan my trip to Destination?\""}, {"name": "Ski-Resort-Bookings", "utterance": " \"I'd like to book a ski resort for my family.\""}, {"name": "Medical Appointment Scheduling", "utterance": " \"What is my next medical appointment time?\""}, {"name": "Shipping-Inquiry", "utterance": "Inquiring about my package delivery status."}, {"name": "Dietary-Supplement-Sales", "utterance": " \"I'm interested in purchasing a dietary supplement, what are your best sellers?\""}, {"name": "Import-Export-Services", "utterance": " \"Can you help me with international shipping and delivery?\""}, {"name": "Health-and-Wellness", "utterance": " \"What health and wellness services are available in City?\""}, {"name": "Pet-Care", "utterance": " \"What is the average cost of grooming a dog?\""}, {"name": "Nutrition-Counseling", "utterance": " \"I can assist you in developing a meal plan for a patient with diabetes and a low carbohydrate diet.\""}, {"name": "Job Application Status", "utterance": " \"I'm having trouble with my job application status. Can you help me?\""}, {"name": "Natural-Remedies", "utterance": " \"I'm looking for natural remedies for my joint pain. Can you recommend some products or techniques?\""}, {"name": "Personal-Financial-Planning", "utterance": " \"I'd like to know about personal financial planning.\""}, {"name": "Fishing-Charters", "utterance": " \"What are the different types of fishing charters available?\""}, {"name": "All-Inclusive-Vacations", "utterance": " \"Where are the best all-inclusive resorts?\""}, {"name": "Airport-Taxis", "utterance": " \"Can you provide a taxi service at the airport?\""}, {"name": "Mental-Health-Support", "utterance": " \"I need someone to talk to. I'm feeling really overwhelmed and I don't know how to cope.\""}, {"name": "Private-Island-Resorts", "utterance": " \"I'm looking for a private island resort with a private beach and luxurious amenities. Can you recommend one?\""}, {"name": "Private-Boat-Charters", "utterance": " \"I'd like to book a private boat charter for a group of 10 for a 3-day sailing trip in the Caribbean.\""}, {"name": "Camping-Trips", "utterance": " \"I'm looking for a campsite with a water source. Can you help me find one with a campground or lake nearby?\""}, {"name": "Mental-Health-First-Aid", "utterance": " \"I'm feeling down and can't seem to shake this feeling. Can you recommend any natural remedies that might help with anxiety?\""}, {"name": "Covid-19-Support", "utterance": " \"I would like to know more about COVID-19 and how it affects the community.\""}, {"name": "Travel-Insurance", "utterance": " \"I need travel insurance for a trip to France.\""}, {"name": "Adventure-Parks", "utterance": " \"What are the best adventure parks in the city?\""}, {"name": "Healthy-Eating-Recipes", "utterance": " \"Can you recommend some healthy meal ideas for vegetarians?\""}, {"name": "Emotional-Intelligence-Development", "utterance": " \"I'm looking for advice on improving my emotional intelligence. Can you help me?\""}, {"name": "Skydiving-Excursions", "utterance": " \"I'd like to book a skydiving excursion for my upcoming vacation. Can you help me plan it?\""}, {"name": "Aromatherapy", "utterance": " \"Can you please prepare a soothing aromatherapy session for me?\""}, {"name": "Nature-Photography-Trips", "utterance": " \"Can you suggest some photography trips in nature?\""}, {"name": "Golf-Course-Reservations", "utterance": " \"I would like to make a reservation for a group of people for a specific date and time. Can you help me with that?\""}, {"name": "Crisis-Communication", "utterance": " \"I can help you with a crisis communication plan. Please provide me with more details about the crisis and what you need help with.\""}, {"name": "Community-Building", "utterance": " \"I'm interested in building a sense of community in our office. Can you help me find resources or strategies for doing so?\""}, {"name": "Hotel-Room-Cleaning", "utterance": "Inquiring about the cleaning status of my hotel room."}, {"name": "Yacht-Charter", "utterance": " \"I'm interested in chartering a yacht for a weekend getaway. Can you help me with that?\""}, {"name": "Stress-Management", "utterance": " \"I am feeling very stressed and overwhelmed. Can you help me find a stress management technique that works for me?\""}, {"name": "Restaurant Reservation", "utterance": " \"I would like to make a reservation for dinner at a restaurant that serves Italian food and has a good view of the city.\""}, {"name": "Self-Care-Routines", "utterance": " \"What are some self-care routines that I can follow?\""}, {"name": "Personal-Finance-Planning", "utterance": " \"What is the best way to manage my personal finances?\""}, {"name": "Personalized-Travel-Plans", "utterance": " \"I'm interested in traveling to destination next month. Can you help me plan a trip?\""}, {"name": "Career-Coaching", "utterance": " \"I'm looking for career coaching to help me with my job search.\""}, {"name": "Outdoor-Recreation", "utterance": " \"I'd like to know about outdoor activities in the park.\""}, {"name": "Educational Course Enrollment", "utterance": " \"I am interested in enrolling in the course 'Introduction to Psychology'.\""}, {"name": "Ziplining-Adventures", "utterance": " \"I can help you plan a ziplining adventure. What is your preferred location and date?\""}, {"name": "Child-Care-Services", "utterance": " \"I need a babysitter for my kiddo tonight.\""}, {"name": "Private-Jet-Reservations", "utterance": " \"I'm looking for a private jet reservation for a special occasion.\""}, {"name": "Weather Forecast", "utterance": " \"What is the weather forecast for the next week?\""}, {"name": "Gardening", "utterance": " \"I'm looking for gardening advice.\""}, {"name": "Mental-Health-Assessments", "utterance": " \"I'm feeling anxious and overwhelmed, can you help me with mental health assessment?\""}, {"name": "Home-Repair-Services", "utterance": " \"What kind of home repair services do you offer?\""}, {"name": "Car Rental Reservation", "utterance": " \"What's the reservation status for booking ID ABC123?\""}, {"name": "Organic-Gardening", "utterance": " \"I'm interested in starting an organic garden. Can you provide me with some advice?\""}, {"name": "Disaster-Relief", "utterance": " \"I am interested in donating money or time for disaster relief efforts.\""}, {"name": "Mountain-Biking-Rentals", "utterance": " \"I'm looking for mountain bikes for a day trip in the mountains. Can you help me find durable and heavy-terrain bikes?\""}, {"name": "Dental-Care-Plans", "utterance": " \"I can help you find a dentist who offers a dental care plan.\""}, {"name": "Cultural-Tours", "utterance": " \"I'm interested in learning more about cultural tours and would like to know more about the options available.\""}, {"name": "Helicopter-Rides", "utterance": " \"I'm interested in taking a helicopter ride over the city.\""}, {"name": "Technical Support", "utterance": " \"I need technical assistance with my computer.\""}, {"name": "Household-Organization", "utterance": " \"Can you assist me in organizing my household?\""}, {"name": "Preparedness-Guides", "utterance": " \"I'm looking for preparedness guides for my community. Can you provide me with some information on how to create and use these guides?\""}, {"name": "Event-Planning-Services", "utterance": " \"I need help planning a wedding or a funeral.\""}, {"name": "Motorcycle-Rental", "utterance": " \"Can you help me find a motorcycle rental company in the area?\""}, {"name": "Sightseeing-Tours", "utterance": " \"What are the available tours in the city?\""}, {"name": "Teacher Employment", "utterance": " \"Can you tell me about job openings in your school for teachers?\""}, {"name": "Meal-Planning", "utterance": " \"I need help planning a meal for the weekend.\""}, {"name": "Furniture-Assembly", "utterance": " \"Can you help me with furniture assembly?\""}, {"name": "Private Beach Club Rentals", "utterance": " \"I'm looking for a private beach club to rent for my next vacation. Do you have any recommendations?\""}, {"name": "Personal-Fitness-Training", "utterance": " \"I can provide you with personal fitness training sessions, types of personal fitness training, and a personal fitness training schedule.\""}]